 export const politicsInput=[
    "قبل ظهور الإسلام، كانت السياسة بين العرب مرتبطة بالقبائل والعشائر","حيث كانت القبيلة تتبع قائدها الذي يحكمها بشكل تقليدي ووراثي","كانت هناك صراعات دائمة بين القبائل للسيطرة على الموارد والأراضي، وكانت الحروب شائعة","بعد ظهور الإسلام، تغيرت السياسة العربية بشكل كبير"," تأسست الدولة الإسلامية على أسس العدل والشورى، حيث يتم اختيار الحاكم بموافقة الناس أو بشورى العلماء والقادة السياسيين"," تأثرت السياسة العربية بقيم الإسلام مثل العدل والتسامح وحقوق الإنسان، وظلت هذه القيم هي المرجعية للحكم والسياسة في العالم الإسلامي"
    ]

 export const cultureInput=["ثقافة العرب في الماضي كانت غنية ومتنوعة. كان للشعر والأدب دور كبير في الثقافة العربية","تأثرت الثقافة العربية بالعديد من الحضارات القديمة مثل الحضارة اليونانية والفارسية"," وقد ازدهرت في العلوم والفنون والفلسفة قبل ظهور الإسلام","حيث كان الشعر يُعتبر وسيلة للتعبير عن المشاعر والأفكار والحكمة"]
          
 
export const religionInput=[
"بعد ظهور الإسلام، تغيرت الثقافة العربية بشكل كبير. أصبح الإسلام الدين السائد والقاعدة الأساسية للحياة اليومية للعرب",
"ظهرت قيم جديدة تمثلت في العدل والتسامح  والتعاون، وأصبحت هذه القيم جزءًا لا يتجزأ من الهوية العربية",
"تطورت العمارة الإسلامية لتشمل المساجد والمدارس والقصور التي تعكس فنوناً وتقاليد معمارية فريدة",
"ولا يزال له تأثير كبير حتى اليوم في حياة العرب والمسلمين في جميع أنحاء العالم  الإسلام بصمته على العديد من المجالات الثقافية والاجتماعية والاقتصاديترك"]


export const sienceInput=["قبل ظهور الإسلام، كان للعرب إسهامات مهمة في مجال العلوم"," كانوا يعملون في مجالات مثل الرياضيات والفلك والطب والفلسفة","وكانت مدن مثل مكة والمدينة المنورة واليرموك مراكز حيوية للعلم والتعليم","بعد ظهور الإسلام، ازدهرت العلوم بشكل أكبر بفضل التشجيع على البحث العلمي والتعليم. نشأت مراكز علمية مثل بيت الحكمة في بغداد","وأصبحت هذه المراكز مراكز لتبادل المعرفة والفكر العلمي بين العرب والعالم الإسلامي","ومن بين أبرز العلماء العرب الذين أثروا في التاريخ العلمي، الفيلسوف العربي ابن سينا والرياضي العربي الخوارزمي والعالم العربي الجابري بن حيان","بفضل الإسهامات العلمية الهامة، أصبحت الثقافة العلمية العربية والإسلامية لها تأثير كبير في تطور العلوم في العصور الوسطى وحتى الوقت الحالي"];