const express=require('express');
const cors = require('cors');

const app = express();

app.use(cors());

const arabCountries = [
    {
        name: "مصر",
        description: "مصر هي دولة تقع في شمال أفريقيا، وتتميز بتاريخها العريق وحضارتها القديمة وآثارها الرائعة.",
        history: {
            ancientHistory: "تاريخ مصر القديم يعود إلى آلاف السنين، حيث نشأت أول حضارة مصرية على ضفاف نهر النيل وازدهرت حضارة الفراعنة وبنوا هرماتهم ومعابدهم الشهيرة.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، تأثرت مصر بالفتوحات الإسلامية وأصبحت مركزًا للثقافة والتعليم والتجارة تحت حكم الدولة الفاطمية والعباسية.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت مصر فترات مختلفة من الحكم الخديوي والاحتلال البريطاني، وفي القرن العشرين حصلت على استقلالها وشهدت تطورات اقتصادية وثقافية وسياسية."
        }
    },
    {
        name: "المغرب",
        description: "المغرب هو دولة تقع في شمال غرب إفريقيا، وتتميز بتنوع ثقافي وتاريخ غني.",
        history: {
            ancientHistory: "تاريخ المغرب القديم يشير إلى وجود ممالك وحضارات متعددة، بما في ذلك حضارة الفينيقيين والرومان والبيزنطيين.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، أصبح المغرب جزءًا من الإمبراطورية الإسلامية وشهد تأثيرات الفنون والعلوم الإسلامية.",
            modernAndContemporaryEra: "في العصر الحديث، عرف المغرب فترات من الاستعمار الفرنسي والحركات الاستقلالية، وحصل على استقلاله في النصف الثاني من القرن العشرين."
        }
    },
    {
        name: "السعودية",
        description: "المملكة العربية السعودية هي دولة تقع في جنوب غرب آسيا، وهي موطن لمقدسات إسلامية وتاريخ غني.",
        history: {
            ancientHistory: "تاريخ السعودية القديم يعود إلى آلاف السنين، حيث كانت المملكة موطنًا للعديد من القبائل العربية القديمة.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، ازدهرت السعودية تحت حكم الدولة العثمانية وأصبحت مركزًا للتجارة والحج.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت السعودية تطورات هامة مع اكتشاف النفط ونشوء المملكة العربية السعودية الحديثة."
        }
    },
    {
        name: "الجزائر",
        description: "الجزائر هي دولة تقع في شمال أفريقيا، وتتميز بتنوع طبيعي وثقافي وتاريخ حافل.",
        history: {
            ancientHistory: "تمتاز الجزائر بتاريخ عريق يعود إلى العديد من الحضارات القديمة مثل الفينيقيين والرومان والمرابطين.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، شهدت الجزائر الفتوحات الإسلامية وتأثيرات الحضارة الإسلامية في المجالات الثقافية والفنية والعلمية.",
            modernAndContemporaryEra: "في العصر الحديث، عرفت الجزائر فترات مختلفة من الاستعمار الفرنسي وحركات الاستقلال والنضال الوطني، وحصلت على استقلالها في القرن العشرين."
        }
    },
    {
        name: "البحرين",
        description: "مملكة البحرين هي دولة صغيرة تقع في الخليج العربي، وتتميز بتاريخها القديم وثقافتها المتنوعة.",
        history: {
            ancientHistory: "تمتلك البحرين تاريخاً يعود إلى آلاف السنين، حيث كانت موطنًا لحضارات قديمة مثل حضارة دلمون وتأثرت بالحضارة السومرية والبابلية.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت البحرين جزءًا من الإمبراطورية الإسلامية وشهدت نموًا اقتصاديًا وثقافيًا تحت حكم الدولة العثمانية.",
            modernAndContemporaryEra: "في العصر الحديث، عرفت البحرين فترات من الهيمنة البرتغالية والاحتلال البريطاني، وحصلت على استقلالها في القرن العشرين وأصبحت مملكة مستقلة."
        }
    },
    {
        name: "جيبوتي",
        description: "جيبوتي هي دولة تقع في القرن الإفريقي، وتتميز بموقعها الاستراتيجي وتنوع ثقافتها.",
        history: {
            ancientHistory: "كانت جيبوتي ممرًا هامًا للتجارة القديمة بين الشرق والغرب، وكانت موطنًا للعديد من الحضارات القديمة مثل حضارة السبأ والأكسومية.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت جيبوتي تحت تأثير الثقافة الإسلامية وشهدت نشاطًا تجاريًا مهمًا بفضل موقعها الجغرافي.",
            modernAndContemporaryEra: "في العصر الحديث، استقلت جيبوتي عن فرنسا في القرن العشرين وأصبحت جمهورية مستقلة، وتعتبر قاعدة بحرية للقوات الدولية."
        }
    },
    {
        name: "العراق",
        description: "العراق هو دولة في غرب آسيا، ويعتبر واحدًا من أقدم الحضارات المعروفة في التاريخ.",
        history: {
            ancientHistory: "تشتهر العراق بأنها موطن حضارات قديمة مثل حضارة سومر وبابل وآشور وميسوبوتاميا.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، أصبح العراق جزءًا من الإمبراطوريات الإسلامية وشهد تطورًا في العلوم والفنون والأدب.",
            modernAndContemporaryEra: "في العصر الحديث، شهد العراق فترات من الهيمنة العثمانية والاستعمار البريطاني والصراعات السياسية، وفي القرن العشرين حصل على استقلاله."
        }
    },
    {
        name: "سوريا",
        description: "سوريا هي دولة تقع في الشرق الأوسط، وتشتهر بتاريخها العريق وتنوع ثقافتها وتراثها الغني.",
        history: {
            ancientHistory: "تعتبر سوريا واحدة من أقدم الحضارات في العالم، حيث ازدهرت حضارة الفراعنة والأكاديين والأموريين والآشوريين في هذه المنطقة.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، تأثرت سوريا بالفتوحات الإسلامية وأصبحت مركزًا للعلم والفنون والثقافة الإسلامية.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت سوريا فترات من الحكم العثماني والاحتلال الفرنسي والصراعات الداخلية، وحاليًا تشهد البلاد حروبًا ونزاعات وأزمات إنسانية."
        }
    },
    {
        name: "فلسطين",
        description: "فلسطين هي منطقة تاريخية في الشرق الأوسط، وتشتهر بتاريخها الغني والمعقد والصراع الفلسطيني الإسرائيلي.",
        history: {
            ancientHistory: "تعتبر فلسطين موطنًا لعدة حضارات قديمة مثل حضارة الكنعانيين والفلسطينيين والإسرائيليين القدماء.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت فلسطين جزءًا من الدولة العباسية وشهدت تأثيرات الحضارة الإسلامية.",
            modernAndContemporaryEra: "في العصر الحديث، تعرضت فلسطين للاحتلال البريطاني والصراع مع إسرائيل، وظلت القضية الفلسطينية محورًا للتوترات والصراعات في المنطقة."
        }
    },
    {
        name: "قطر",
        description: "قطر هي دولة تقع في شبه الجزيرة العربية، وتشتهر بثرواتها الطبيعية واقتصادها المزدهر.",
        history: {
            ancientHistory: "تشتهر قطر بتاريخها البحري العريق، حيث كانت موطنًا للعديد من القبائل العربية البحارة.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، تأثرت قطر بالثقافة الإسلامية وكانت محطًا للتجارة البحرية والاستكشاف.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت قطر تحولًا اقتصاديًا هائلًا مع اكتشاف النفط، وأصبحت واحدة من أغنى دول العالم ومركزًا للتجارة والمال والأعمال."
        }
    },
    {
        name: "جزر القمر",
        description: "جزر القمر هي مجموعة من الجزر تقع في المحيط الهندي قبالة الساحل الشرقي لإفريقيا، وتشتهر بجمال طبيعتها الخلابة وتنوع ثقافتها.",
        history: {
            ancientHistory: "تمتاز جزر القمر بتاريخ غني يعود إلى العديد من الحضارات القديمة مثل الفينيقيين والعرب والبحارة البرتغاليين.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، تأثرت جزر القمر بالثقافة الإسلامية وأصبحت محطة للتجارة البحرية والثقافية في المنطقة.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت جزر القمر فترات من الاستعمار الفرنسي والاستقلال والتحولات السياسية والاقتصادية."
        }
    },
    {
        name: "اليمن",
        description: "اليمن هو بلد في جنوب غرب شبه الجزيرة العربية، ويتميز بتاريخه العريق وثقافته الغنية وتنوع طبيعته.",
        history: {
            ancientHistory: "يعتبر اليمن واحدًا من أقدم المراكز الحضارية في العالم، حيث ازدهرت حضارة سبأ القديمة ومملكة حمير وحضارة حضرموت.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت اليمن محطًا للتجارة بين الشرق والغرب وشهدت انتشار الإسلام وتأثيره في الثقافة والحياة اليومية.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت اليمن فترات من الحكم العثماني والاستعمار البريطاني والصراعات الداخلية وحرباً أهلية."
        }
    },
    {
        name: "الإمارات العربية المتحدة",
        description: "الإمارات العربية المتحدة هي دولة تقع في شرق شبه الجزيرة العربية، وتتكون من سبع إمارات تتميز بثراء طبيعي وثقافي.",
        history: {
            ancientHistory: "تمتاز الإمارات بتاريخ غني يعود إلى العصور القديمة حيث كانت موطنًا لحضارات قديمة مثل حضارة ماجان وحضارة أوم النار.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، تأثرت الإمارات بالحضارة الإسلامية وشهدت نموًا اقتصاديًا وثقافيًا بفضل التجارة والزراعة والصيد.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت الإمارات نهضةً حضاريةً واقتصاديةً مع اكتشاف النفط، وأصبحت واحدة من أغنى دول العالم ومركزًا للتجارة والسياحة."
        }
    },
    {
        name: "عُمان",
        description: "عُمان هي دولة تقع في شرق الجزيرة العربية، وتتميز بتنوع طبيعي وثقافي وتاريخ غني.",
        history: {
            ancientHistory: "تعتبر عُمان واحدة من أقدم الحضارات في العالم، حيث تمتد تاريخها إلى العصور القديمة مع وجود آثار حضارة مثل مدينة دماوند.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت عُمان محطًا للتجارة البحرية وشهدت تأثيرات الثقافة الإسلامية مع انتشار الإسلام في المنطقة.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت عُمان فترات من الحكم العثماني والاستعمار البرتغالي، وحصلت على استقلالها في القرن العشرين وأصبحت مملكة مستقلة."
        }
    },
    {
        name: "الصومال",
        description: "الصومال هو بلد في القرن الإفريقي، وتتميز بثرواتها الطبيعية وتاريخها القديم وتنوع ثقافتها.",
        history: {
            ancientHistory: "تاريخ الصومال يعود إلى آلاف السنين، حيث كانت المنطقة موطنًا للحضارات القديمة مثل حضارة بونت وحضارة أكسوم.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت الصومال محطًا للتجارة بين الشرق والغرب وتأثرت بالحضارة الإسلامية والثقافة العربية.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت الصومال فترات من الاستعمار الأوروبي والصراعات الداخلية والحروب الأهلية."
        }
    },
    {
        name: "السودان",
        description: "السودان هو دولة في شمال شرق إفريقيا، وتشتهر بتاريخها العريق وتنوع ثقافاتها وثرواتها الطبيعية.",
        history: {
            ancientHistory: "تعتبر السودان موطنًا لحضارات قديمة مثل حضارة كوش وحضارة مروي وحضارة نوبية.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت السودان تحت تأثير الحضارة الإسلامية وشهدت تأثيراتها في الثقافة والفن والعلم.",
            modernAndContemporaryEra: "في العصر الحديث، شهد السودان فترات من الاستعمار البريطاني والصراعات الداخلية والحروب الأهلية وانقسام البلاد إلى جنوب وشمال."
        }
    },
    {
        name: "تونس",
        description: "تونس هي دولة في شمال إفريقيا، وتشتهر بتاريخها العريق وثقافتها الغنية ومعالمها السياحية الفريدة.",
        history: {
            ancientHistory: "تاريخ تونس يعود إلى العصور القديمة حيث كانت المنطقة موطنًا لحضارات قديمة مثل حضارة كارثاجو وحضارة الفينيقيين.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت تونس جزءًا من الإمبراطورية الإسلامية وشهدت ازدهارًا اقتصاديًا وثقافيًا وعلميًا.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت تونس فترات من الاحتلال الأوروبي والاستقلال والتحولات السياسية والاقتصادية وثورة الياسمين."
        }
    },
    {
        name: "الكويت",
        description: "الكويت هي دولة في شبه الجزيرة العربية، وتشتهر بثرواتها النفطية واقتصادها المزدهر.",
        history: {
            ancientHistory: "تاريخ الكويت القديم يعود إلى العصور القديمة حيث كانت موطنًا للعديد من القبائل العربية وكانت محطًا للتجارة بين البحرين والعراق والشام.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، كانت الكويت مركزًا للتجارة البحرية والثقافة الإسلامية وشهدت تأثيرات الدولة العثمانية.",
            modernAndContemporaryEra: "في العصر الحديث، تحولت الكويت إلى دولة مستقلة وشهدت نموًا اقتصاديًا كبيرًا مع اكتشاف النفط في القرن العشرين وأصبحت واحدة من أغنى دول العالم."
        }
    },
    {
        name: "لبنان",
        description: "لبنان هو دولة تقع في الشرق الأوسط، وتشتهر بتنوع طوائفها الدينية وتاريخها الغني وثقافتها المتنوعة.",
        history: {
            ancientHistory: "تاريخ لبنان يعود إلى العصور القديمة حيث ازدهرت حضارات عديدة مثل حضارة الفينيقيين والرومان والبيزنطيين.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، تأثرت لبنان بالثقافة الإسلامية وشهدت تطورًا في العلوم والفنون والأدب تحت حكم الدولة العثمانية.",
            modernAndContemporaryEra: "في العصر الحديث، شهد لبنان فترات من الاستعمار الفرنسي والحروب الداخلية والصراعات السياسية والدينية."
        }
    },
    {
        name: "ليبيا",
        description: "ليبيا هي دولة تقع في شمال أفريقيا، وتشتهر بثرواتها الطبيعية وتاريخها العريق وتنوع ثقافتها.",
        history: {
            ancientHistory: "تعتبر ليبيا موطنًا لحضارات قديمة مثل حضارة الفينيقيين والرومان والبيزنطيين، وكانت جزءًا من الإمبراطورية الرومانية.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، تأثرت ليبيا بالحضارة الإسلامية وشهدت تطورًا اقتصاديًا وثقافيًا تحت حكم الدولة الفاطمية والعثمانية.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت ليبيا فترات من الاستعمار الإيطالي والصراعات الداخلية والثورات، وحاليًا تشهد البلاد صراعات سياسية واقتصادية."
        }
    },
    {
        name: "موريتانيا",
        description: "موريتانيا هي دولة تقع في شمال غرب إفريقيا، وتشتهر بتنوع ثقافاتها وتاريخها العريق.",
        history: {
            ancientHistory: "تعتبر موريتانيا موطنًا لحضارات قديمة مثل حضارة وادي النيل ومملكة غانا وإمبراطورية مالي.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، تأثرت موريتانيا بالحضارة الإسلامية وشهدت تطورًا في العلوم والفنون والتجارة.",
            modernAndContemporaryEra: "في العصر الحديث، شهدت موريتانيا فترات من الاستعمار الفرنسي والاستقلال والتحولات السياسية والاقتصادية."
        }
    },
    {
        name: "الأردن",
        description: "الأردن هو دولة تقع في منطقة الشرق الأوسط، وتتميز بتاريخها العريق وطبيعتها الخلابة.",
        history: {
            ancientHistory: "يعود تاريخ الأردن القديم إلى آلاف السنين، حيث كانت المنطقة موطنًا لحضارات عديدة مثل الأمويين والعباسيين والأموريين.",
            middleAgesAndIslamicEra: "خلال العصور الوسطى، ازدهرت العديد من المدن الأردنية كمركز للحضارة والعلم والفن تحت حكم الدولة العثمانية.",
            modernAndContemporaryEra: "في العصر الحديث، شهد الأردن فترات من الانتداب البريطاني والاستقلال والتحديات السياسية والاقتصادية الحديثة."
        }
    },
];
app.get('/arabsApi',(req,res)=>{
    res.json(arabCountries)
})
const port = process.env.PORT || 3000;
app.listen(port,console.log('http://localhost:3000'))